Барбершоп/Documents/УстановкаУчетнойПолитикиОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>УстановкаУчетнойПолитикиОрганизации</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УчетнаяПолитика</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчетнаяПолитика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетнойПолитики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Барбершоп/InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяПолитика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетнойПолитики</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Барбершоп/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Барбершоп/Enums/ВидыУчетнойПолитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыУчетнойПолитики</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FEFO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Барбершоп/Documents/УстановкаУчетнойПолитикиОрганизации/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	
	Движения.УчетнаяПолитика.Записывать = Истина;
	Движение = Движения.УчетнаяПолитика.Добавить();
	Движение.Период = Дата;
	Движение.УчетнаяПолитика = УчетнаяПолитика;
	
	Если УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.ПоСредней Тогда //1*
		
		Движения.ТоварыНаСкладах.Записывать = Истина; //2
		
		Блокировка = Новый БлокировкаДанных; //3
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос; //4
		Запрос.Текст =
		"ВЫБРАТЬ
		|    ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|    ТоварыНаСкладахОстатки.Склад КАК Склад,
		|    ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
		|    ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
		|    ТоварыНаСкладахОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|    РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментИтогов, ) КАК ТоварыНаСкладахОстатки";
		
		Запрос.УстановитьПараметр("МоментИтогов", Новый Граница(МоментВремени())); //5
		
		Выборка = Запрос.Выполнить().Выбрать(); //6
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ТоварыНаСкладах.ДобавитьРасход(); //7
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			
			Движение = Движения.ТоварыНаСкладах.ДобавитьПриход(); //8
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка,,"СрокГодности");
			
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры
